# ThermalMaterialParamPorosity Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ThermalMaterialParamPorosity Property
ParameterTypeId Class See Also
---
"Porosity"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ThermalMaterialParamPorosity { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ThermalMaterialParamPorosity As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ThermalMaterialParamPorosity {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace